---
kind: method
id: M:Autodesk.Revit.DB.CurtainGrid.GetUGridLineIds
source: html/0cab3f8e-34a3-4705-352b-93a9eadefbbd.htm
---
# Autodesk.Revit.DB.CurtainGrid.GetUGridLineIds Method

Gets all ElementIds of grid lines in the U direction.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetUGridLineIds()
```

## Returns
The U grid line ElementIds